[Killed] ConditionForcing
lib/calculator.rb:3:8
 class Calculator
   def eligible?(age)
-    if age >= 18
+    if true
       "yes"
     else

[Killed] Literal
lib/calculator.rb:3:15
 class Calculator
   def eligible?(age)
-    if age >= 18
+    if age >= 0
       "yes"
     else

[Killed] Literal
lib/calculator.rb:4:7
 class Calculator
   def eligible?(age)
     if age >= 18
-      "yes"
+      ""
     else
       "no"

[Killed] Literal
lib/calculator.rb:6:7
     if age >= 18
       "yes"
     else
-      "no"
+      ""
     end
   end

[Killed] StatementDeletion
lib/calculator.rb:11:5
   end
 
   def discount(total)
-    return 0 if total < 100
+    
     total / 10
   end

[Killed] EarlyReturn
lib/calculator.rb:11:5
   end
 
   def discount(total)
-    return 0 if total < 100
+    0 if total < 100
     total / 10
   end

[Killed] StatementDeletion
lib/calculator.rb:12:5
 
   def discount(total)
     return 0 if total < 100
-    total / 10
+    
   end
 

[Killed] Literal
lib/calculator.rb:12:13
 
   def discount(total)
     return 0 if total < 100
-    total / 10
+    total / 0
   end
 

[NoCoverage] Literal
lib/calculator.rb:16:5
   end
 
   def untested_helper
-    42
+    43
   end
 end

[NoCoverage] Literal
lib/calculator.rb:16:5
   end
 
   def untested_helper
-    42
+    0
   end
 end
